### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.container_apps.azurerm_role_assignment.eventhub_namespace_reminder_write will be created
  + resource "azurerm_role_assignment" "eventhub_namespace_reminder_write" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b1750a28-0b00-45c7-9b49-a8f33c160de7"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Event Hubs Data Sender"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.EventHub/namespaces/io-p-itn-com-etl-evhns-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage_api_weu.module.storage_api_replica.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.Storage/storageAccounts/iopstapireplica"
        name                               = "iopstapireplica"
        tags                               = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (97 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "212.105.155.159",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.web_apps.module.citizen_func_new.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-citizen-func-02"
        name                                           = "io-p-itn-com-citizen-func-02"
      ~ tags                                           = {
            "BusinessUnit"                           = "App IO"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO Comunicazione"
            "ModuleName"                             = "azure_function_app"
            "ModuleSource"                           = "DX"
          ~ "ModuleVersion"                          = "4.0.0" -> "4.1.1"
            "Source"                                 = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-resource-id" = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (34 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.web_apps.module.citizen_func_new.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-citizen-func-02/slots/staging"
        name                                           = "staging"
      ~ tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "4.0.0" -> "4.1.1"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.web_apps.module.citizen_func_new.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/metricAlerts/[io-p-itn-com-citizen-func-02] Health Check Failed"
        name                     = "[io-p-itn-com-citizen-func-02] Health Check Failed"
      ~ tags                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "4.0.0" -> "4.1.1"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.web_apps.module.citizen_func_new.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitncomcitizenstfn02] Low Availability"
        name                     = "[iopitncomcitizenstfn02] Low Availability"
      ~ tags                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "4.0.0" -> "4.1.1"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.web_apps.module.citizen_func_new.azurerm_private_endpoint.function_sites will be updated in-place
  ~ resource "azurerm_private_endpoint" "function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-com-citizen-func-pep-02"
        name                          = "io-p-itn-com-citizen-func-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "4.0.0" -> "4.1.1"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.web_apps.module.citizen_func_new.azurerm_private_endpoint.st_blob will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_blob" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-com-citizen-func-blob-pep-02"
        name                          = "io-p-itn-com-citizen-func-blob-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "4.0.0" -> "4.1.1"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.web_apps.module.citizen_func_new.azurerm_private_endpoint.st_file will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_file" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-com-citizen-func-file-pep-02"
        name                          = "io-p-itn-com-citizen-func-file-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "4.0.0" -> "4.1.1"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.web_apps.module.citizen_func_new.azurerm_private_endpoint.st_queue will be updated in-place
  ~ resource "azurerm_private_endpoint" "st_queue" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-com-citizen-func-queue-pep-02"
        name                          = "io-p-itn-com-citizen-func-queue-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "4.0.0" -> "4.1.1"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.web_apps.module.citizen_func_new.azurerm_private_endpoint.staging_function_sites[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "staging_function_sites" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-com-citizen-staging-func-pep-02"
        name                          = "io-p-itn-com-citizen-staging-func-pep-02"
      ~ tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "4.0.0" -> "4.1.1"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.web_apps.module.citizen_func_new.azurerm_service_plan.this[0] will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                              = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-com-citizen-asp-02"
        name                            = "io-p-itn-com-citizen-asp-02"
      ~ tags                            = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "4.0.0" -> "4.1.1"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (12 unchanged attributes hidden)
    }

  # module.web_apps.module.citizen_func_new.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncomcitizenstfn02"
        name                               = "iopitncomcitizenstfn02"
      ~ tags                               = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "4.0.0" -> "4.1.1"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (97 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 12 to change, 0 to destroy.
```

</details>
